nthphucmia/Code-Stm32f10x/12. PID/2. Test/pPart/PID_6/Source/main.c
/********************************************************************************
 1. Use time1 with 4 channels to control 2 motors for PWM are TIM2_CH3 with frequency 2kHz. 
 2. Two encoders combined in motors have 2 phase A,B read by TIM3 with interrupt configuration.
 3. TIM4 is interrupted every 10ms to calculate the velocity.
 4. The calculated velocity is printed in PC by UART with baud rate: 115200
 
 The connected diagram
 STM32F103C8:
 PA2, PA3: Module UART2
 PA6, PA7: phase A, B encoder (motor2) - TIM3				
 PA0, PA1: upper and lower bridge driver motor1		
 PA2: TIM2-CH3
 ----------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_it.h"
#include "delay.h"
#include "stdio.h"
#include "Usart_serial.h"
#include "User_interrupt.h"
#include "GPIO_Configuration.h"
#include "Encoder_Configuration.h"
#include "DC_Motor_Control.h"
#include "stm32f10x_type.h"
#include "stdio.h"

/* Private variables ---------------------------------------------------------*/
TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
NVIC_InitTypeDef 		NVIC_InitStructure;
GPIO_InitTypeDef  	GPIO_InitStructure;
EXTI_InitTypeDef  	EXTI_InitStructure;
TIM_OCInitTypeDef 	TIM_OCInitStructure;
TIM_ICInitTypeDef 	TIM_ICInitStructure;
TIM_ICInitTypeDef 	TIM_ICInitStructure;

volatile uint32_t Pulse_value;
volatile uint32_t encoder_cnt, encoder_cnt_pre;


int main(void)
{ 	
	// Pin configuration-------------------------------------------
  Motor_pin_Configuration();
	Encoder_pin_Configuraton();
	
	//Encoder Activating-------------------------------------------
	Encoder_System_Configuration();
	
	//Dung timer4 lam bo dinh thi 10ms, sampling time--------------
	Encoder_Configuration();
  NVIC_Configuration();
	
	// PWM Init
	PWM_Configuration(2);
	
	//dung timer2 lam PWM generator, Period=8000 
	//Run_Motor(3000);
	//Stop_Motor_no_BRA();
	
	
	while (1)
  {		
		
	}
}
